In [ ]:
import pandas as pd

# 2 main types of Datatypes
### 1. Series
### 2. Frames

In [6]:
series1 = pd.Series(["Data1","Data2"]) # Similar to Array
print(series1)
series2 = pd.Series([1,2,3])

0    Data1
1    Data2
dtype: object

In [11]:
# 2. DataFrames - it is usually Multidimentional
# it can accepts series or array as value and column-header as key
mydataFrame = pd.DataFrame({"Series1":series1,"series2":series2})
mydataFrame

  Series1  series2
0   Data1        1
1   Data2        2
2     NaN        3

In [43]:
# We can read from CSVs
car_sales = pd.read_csv("./sample_data/car-sales.csv")
# We can also pass the CSVs URL to import it


car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [44]:
# We can export cvs as 
car_sales['Price'] = car_sales['Price'] + ' Money :)'
car_sales.to_csv('./sample_data/new-car.csv',index=False) # this index=false will not include the index column of the frame while creating CSVs

# Describing the Data

In [22]:
car_sales.dtypes  #datatypes of the columns

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [27]:
car_sales.columns   #returns lists of all column-names

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [28]:
car_sales.describe()    # describes the datawith some stats

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [32]:
car_sales.mean()   
# function also available for series

C:\Users\Dhyanesh Panchal\AppData\Local\Temp\ipykernel_2928\2320724050.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [34]:
car_sales['Doors'].mode()

0    4
Name: Doors, dtype: int64

# Viewing and Selecting the Data

In [35]:
car_sales.head(4)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [36]:
car_sales.tail(4)

     Make Colour  Odometer (KM)  Doors      Price
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

##### `.loc[]` and `.ilock[]`

In [40]:
# .loc[] stands for location and it return the row with the given index (remember index can be different)

colors = pd.Series(['Red','Blue','Green'],index=[2,4,10])

colors.loc[2]

'Red'

In [41]:
colors.iloc[2]  # .iloc[] refers to the natural-index.

'Green'